package de.telran;

public class Ht0210232 {
    public static void main(String[] args) {
        int a = 20, b = 10;
        int sum = a + b;
        System.out.println(sum);

        int dif = a - b;
        System.out.println(dif);

        int mul = a * b;
        System.out.println(mul);

        int dev = a / b;
        System.out.println(dev);

    }
}
    /*    №2
        Реализовать программу, выводящую на экран результаты:
        Сложения двух чисел
        Вычитания двух чисел
        Умножения двух чисел
        Деления двух чисел
        Каждая из арифметических операций должна быть реализована как отдельный метод. */