package de.telran;

public class Ht2809232 {
    public static void main(String[] args) {

        int a = 250, b = 50;

        int sum = a + b;
        int mul = a * b;
        int dif = a -b;
        int dev = a / b;

        System.out.println(sum);
        System.out.println(mul);
        System.out.println(dif);
        System.out.println(dev);

     /* № 2
Создайте методы с математическими операциями +, -, *, /
Каждый метод принимает два числа в параметрах и возвращает результат
Вызовите все методы в main
Результат распечатайте в консоль */
    }
}
